ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define LRCCONF130_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF130_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF130_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF130_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF130_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MAX 10                        /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_SIZE 11                       /*!< (unspecified)                                                        */
#define LRCCONF130_OTHERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF130_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF130_POWERON_MAIN_RESET 1              /*!< Reset value of register POWERON.MAIN: 1                              */
#define LRCCONF130_POWERON_ACT_RESET 1               /*!< Reset value of register POWERON.ACT: 1                               */
#define LRCCONF130_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF130_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF300_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF300_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF300_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF300_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_MAX 7                        /*!< (unspecified)                                                        */
#define LRCCONF300_NCLK_SIZE 8                       /*!< (unspecified)                                                        */
#define LRCCONF300_CLKCTRL 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF300_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF300_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF300_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF300_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF300_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF300_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF300_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF300_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF300_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF300_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF310_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF310_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF310_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF310_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF310_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF310_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF310_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF310_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF310_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF310_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF310_POWERON_MAIN_RESET 0              /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF310_POWERON_ACT_RESET 0               /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF310_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF310_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

#define LRCCONF_SDCARD_POWERON 1                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_RETAIN 1                      /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_SYSTEMOFF 1                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_LRCREQHFXO 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_MAX 7                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NCLK_SIZE 8                   /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_CLKCTRL 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MIN 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_MAX 0                  /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NACTPD_SIZE 1                 /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_PDACT 1                       /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MIN 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_MAX 7                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NPD_SIZE 8                    /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_OTHERON 0                     /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MIN 0                /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_MAX 15               /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_NDOMAINS_SIZE 16              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_AX2XWAITSTATES 0              /*!< (unspecified)                                                        */
#define LRCCONF_SDCARD_POWERON_MAIN_RESET 0          /*!< Reset value of register POWERON.MAIN: 0                              */
#define LRCCONF_SDCARD_POWERON_ACT_RESET 0           /*!< Reset value of register POWERON.ACT: 0                               */
#define LRCCONF_SDCARD_RETAIN_MAIN_RESET 1           /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF_SDCARD_RETAIN_ACT_RESET 1            /*!< Reset value of register RETAIN.ACT: 1                                */

/*PCGC Master*/
#define PCGCMASTER_PRESENT 1
#define PCGCMASTER_COUNT 16

#define PCGCM200_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM200_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM200_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM200_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM210_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM210_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM210_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM210_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM110_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM110_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM110_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM110_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

