ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define PCGCM120_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM120_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM120_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM120_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM121_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM121_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM121_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM121_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM130_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM130_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM130_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM130_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM131_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM131_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM131_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM131_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM132_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM132_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM132_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM132_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM133_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM133_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM133_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM133_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM134_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM134_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM134_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM134_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM135_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM135_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM135_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM135_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM136_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM136_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM136_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM136_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM137_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM137_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM137_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM137_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM138_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM138_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM138_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM138_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM300_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM300_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM300_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM300_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM310_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM310_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM310_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM310_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

