ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
/*PCGCSlave*/
#define PCGCSLAVE_PRESENT 1
#define PCGCSLAVE_COUNT 15

#define PCGCS200_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS200_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS200_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS200_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS200_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS110_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS110_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS110_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS110_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS110_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS120_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS120_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS120_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS120_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS120_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS121_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS121_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS121_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS121_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS121_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS122_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS122_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS122_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS122_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS122_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS130_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS130_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS130_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS130_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS130_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS131_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS131_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS131_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS131_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS131_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS132_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS132_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS132_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS132_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS132_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS133_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS133_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS133_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS133_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS133_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS134_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS134_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS134_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS134_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS134_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

