ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define PCGCS135_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS135_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS135_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS135_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS135_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS136_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS136_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS136_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS136_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS136_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS137_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS137_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS137_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS137_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS137_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS138_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS138_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS138_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCS138_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS138_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_MAX 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NUM_CLOCK_POWER_PAIR_SIZE 2         /*!< Number of clock/power pairs used by PCGC Slave - [0..1]              */
#define PCGCSBUS_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCSBUS_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

/*VPR CLIC registers*/
#define CLIC_PRESENT 1
#define CLIC_COUNT 1

#define VPRCLIC_IRQ_COUNT 32
#define VPRCLIC_IRQNUM_MIN 0                         /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_MAX 479                       /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_SIZE 480                      /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_CLIC_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_TASKS_MASK 0xFFFFF0FF           /*!< Mask of supported VEVIF tasks: 0xFFFFF0FF                            */
#define VPRCLIC_COUNTER_IRQ_NUM 32                   /*!< VPR counter (CNT0) interrupt handler number (COUNTER_IRQ_NUM): 32    */
#define VPRCLIC_CLIC_VPR_1_2 1                       /*!< (unspecified)                                                        */

/*VTIM CSR registers*/
#define VTIM_PRESENT 1
#define VTIM_COUNT 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 1

#define L2CACHE_VIRTUALCACHE 1                       /*!< (unspecified)                                                        */
#define L2CACHE_FLUSH 0                              /*!< (unspecified)                                                        */
#define L2CACHE_CLEAN 0                              /*!< (unspecified)                                                        */
#define L2CACHE_NONCACHEABLEMISS 0                   /*!< (unspecified)                                                        */
#define L2CACHE_BUSWIDTH_MIN 0                       /*!< Data bus width : 0..63                                               */
#define L2CACHE_BUSWIDTH_MAX 63                      /*!< Data bus width : 0..63                                               */
#define L2CACHE_BUSWIDTH_SIZE 64                     /*!< Data bus width : 0..63                                               */
#define L2CACHE_SECUREINVALIDATE 1                   /*!< (unspecified)                                                        */

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 9

#define RAMC110_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC110_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC111_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC111_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC112_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC112_SEC 0                                /*!< (unspecified)                                                        */

