ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define RAMC120_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC120_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC121_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC121_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC130_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC130_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC131_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC131_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC122_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC122_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC123_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC123_SEC 0                                /*!< (unspecified)                                                        */

/*CRACEN*/
#define SHA3_PRESENT 1
#define SHA3_COUNT 1

#define SHA3_CRYPTOACCELERATOR 0                     /*!< (unspecified)                                                        */
#define SHA3_SEEDRAMLOCK 0                           /*!< (unspecified)                                                        */

/*EXternal Memory Encryption Engine*/
#define EXMEE_PRESENT 1
#define EXMEE_COUNT 1

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

#define MVDMA_PRESENT 1
#define MVDMA_COUNT 3

#define MVDMA110_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA110_DPPI_DISCONNECTED 0                 /*!< (unspecified)                                                        */
#define MVDMA110_INSTANCE_IN_WRAPPER 0               /*!< (unspecified)                                                        */

#define MVDMA120_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA120_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA120_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */

#define MVDMA121_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA121_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA121_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */

/*PPIB APB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 11

#define PPIB110_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB120_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB121_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB130_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_MAX 31                  /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_SIZE 32                 /*!< (unspecified)                                                        */

#define PPIB131_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_MAX 23                  /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_SIZE 24                 /*!< (unspecified)                                                        */

#define PPIB132_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB132_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB132_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB133_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB133_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB133_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB134_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB134_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB134_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB135_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB135_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB135_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB136_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB136_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB136_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

