ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define PPIB137_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB137_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB137_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

/*ROM Controller*/
#define ROMC_PRESENT 1
#define ROMC_COUNT 1

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 3

#define MEMCONF120_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF120_REPAIR 1                          /*!< (unspecified)                                                        */
#define MEMCONF120_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF120_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF120_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF120_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF120_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF120_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

#define MEMCONF130_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF130_REPAIR 0                          /*!< (unspecified)                                                        */
#define MEMCONF130_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF130_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF130_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF130_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF130_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF130_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

#define MEMCONF310_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR 0                          /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF310_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 2

#define RESETINFO120_HASRESETREAS 1                  /*!< (unspecified)                                                        */
#define RESETINFO120_CROSSDOMAINRESET 0              /*!< (unspecified)                                                        */

#define RESETINFO130_HASRESETREAS 1                  /*!< (unspecified)                                                        */
#define RESETINFO130_CROSSDOMAINRESET 0              /*!< (unspecified)                                                        */

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 3

#define WDT130_START_ON_RESET 1                      /*!< (unspecified)                                                        */
#define WDT130_CRV_RESETVALUE 65536                  /*!< (unspecified)                                                        */
#define WDT130_ALLOW_STOP 1                          /*!< (unspecified)                                                        */
#define WDT130_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT131_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT131_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT131_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT131_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT132_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT132_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT132_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT132_HAS_INTEN 1                           /*!< (unspecified)                                                        */

/*GRCCONF*/
#define GRCCONF_PRESENT 1
#define GRCCONF_COUNT 1

#define GRCCONF_PORBOR 1                             /*!< (unspecified)                                                        */
#define GRCCONF_ACKHANDLER 1                         /*!< (unspecified)                                                        */

