ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
/*PCRM*/
#define PCRM_PRESENT 1
#define PCRM_COUNT 1

/*CLOCK*/
#define CLOCK_PRESENT 1
#define CLOCK_COUNT 1

#define CLOCK_BACKDOOR_REGISTERS 1                   /*!< (unspecified)                                                        */

/*LFRC peripheral*/
#define LFRC_PRESENT 1
#define LFRC_COUNT 1

/*LFLPRC peripheral*/
#define LFLPRC_PRESENT 1
#define LFLPRC_COUNT 1

/*LFXO peripheral*/
#define LFXO_PRESENT 1
#define LFXO_COUNT 1

/*FLL16M*/
#define FLL16M_PRESENT 1
#define FLL16M_COUNT 1

/*HFXO64M peripheral*/
#define HFXO64M_PRESENT 1
#define HFXO64M_COUNT 1

/*CLKMON peripheral*/
#define CLKMON_PRESENT 1
#define CLKMON_COUNT 1

/*POWER*/
#define POWER_PRESENT 1
#define POWER_COUNT 1

#define POWER_NABBDOMAIN_MIN 0                       /*!< Number of ABB domains: 0..3                                          */
#define POWER_NABBDOMAIN_MAX 3                       /*!< Number of ABB domains: 0..3                                          */
#define POWER_NABBDOMAIN_SIZE 4                      /*!< Number of ABB domains: 0..3                                          */
#define POWER_NATBGNDCLAMP_MIN 0                     /*!< Number of ATB ground clamps: 0..17                                   */
#define POWER_NATBGNDCLAMP_MAX 17                    /*!< Number of ATB ground clamps: 0..17                                   */
#define POWER_NATBGNDCLAMP_SIZE 18                   /*!< Number of ATB ground clamps: 0..17                                   */
#define POWER_PMICENABLE 0                           /*!< (unspecified)                                                        */
#define POWER_REGCONFIG 1                            /*!< (unspecified)                                                        */

/*VREGMAIN peripheral*/
#define VREGMAIN_PRESENT 1
#define VREGMAIN_COUNT 1

#define VREGMAIN_WIFI_SUPPORTED 1                    /*!< (unspecified)                                                        */

/*VREGAO1V8 peripheral*/
#define VREGAO1V8_PRESENT 1
#define VREGAO1V8_COUNT 1

/*VREG1V0*/
#define VREG1V0_PRESENT 1
#define VREG1V0_COUNT 1

#define VREG1V0_ENABLE_HELPER_MODES 1                /*!< (unspecified)                                                        */

/*VREGAO0V8 peripheral*/
#define VREGAO0V8_PRESENT 1
#define VREGAO0V8_COUNT 1

#define VREGAO0V8_OVERRIDE_CFGDYNAMIC 1              /*!< (unspecified)                                                        */

/*VREGVS0V8 peripheral*/
#define VREGVS0V8_PRESENT 1
#define VREGVS0V8_COUNT 3

#define VREGVS0V8_INCLUDE_PCGCS 0                    /*!< (unspecified)                                                        */
#define VREGVS0V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MIN 0 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                            [0..2]*/
#define VREGVS0V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MAX 2 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                            [0..2]*/
#define VREGVS0V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_SIZE 3 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                             [0..2]*/
#define VREGVS0V8_VREGVS0V8_NOTFULLPCPZERO 0         /*!< (unspecified)                                                        */
#define VREGVS0V8_HIGHER_CURRENT_LIMIT 1             /*!< (unspecified)                                                        */
#define VREGVS0V8_ADD_HP_HELPER_MODE 1               /*!< (unspecified)                                                        */

#define VREG1V80V8_INCLUDE_PCGCS 0                   /*!< (unspecified)                                                        */
#define VREG1V80V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MIN 0 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                             [0..2]*/
#define VREG1V80V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MAX 2 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                             [0..2]*/
#define VREG1V80V8_VREGVS0V8_NUM_CLOCK_POWER_PAIR_SIZE 3 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                              [0..2]*/
#define VREG1V80V8_VREGVS0V8_NOTFULLPCPZERO 0        /*!< (unspecified)                                                        */
#define VREG1V80V8_HIGHER_CURRENT_LIMIT 1            /*!< (unspecified)                                                        */
#define VREG1V80V8_ADD_HP_HELPER_MODE 1              /*!< (unspecified)                                                        */

#define VREGGFX_INCLUDE_PCGCS 1                      /*!< (unspecified)                                                        */
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MIN 0 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..2]*/
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_MAX 2 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..2]*/
#define VREGGFX_VREGVS0V8_NUM_CLOCK_POWER_PAIR_SIZE 3 /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                           [0..2]*/
#define VREGGFX_VREGVS0V8_NOTFULLPCPZERO 0           /*!< (unspecified)                                                        */
#define VREGGFX_HIGHER_CURRENT_LIMIT 1               /*!< (unspecified)                                                        */
#define VREGGFX_ADD_HP_HELPER_MODE 1                 /*!< (unspecified)                                                        */

/*VREGSU peripheral*/
#define VREGSU_PRESENT 1
#define VREGSU_COUNT 1

/*VREGMRAM peripheral*/
#define VREGMRAM_PRESENT 1
#define VREGMRAM_COUNT 2

/*OSCRFR peripheral*/
#define OSCRFR_PRESENT 1
#define OSCRFR_COUNT 1

/*SWEXT peripheral*/
#define SWEXT_PRESENT 1
#define SWEXT_COUNT 1

/*MBIAS peripheral*/
#define MBIAS_PRESENT 1
#define MBIAS_COUNT 1

/*VDETAO1V8 peripheral*/
#define VDETAO1V8_PRESENT 1
#define VDETAO1V8_COUNT 1

/*VDETAO0V8 peripheral*/
#define VDETAO0V8_PRESENT 1
#define VDETAO0V8_COUNT 1

/*VDETVS0V8 peripheral*/
#define VDETVS0V8_PRESENT 1
#define VDETVS0V8_COUNT 1

/*VDETIO peripheral*/
#define VDETIO_PRESENT 1
#define VDETIO_COUNT 1

#define VDETIO_CONFIG_PWRGOOD_RESET 894              /*!< Reset value of register CONFIG.PWRGOOD: 894                          */
#define VDETIO_NPORTS_MIN 0                          /*!< Number of ports supported : 0..9                                     */
#define VDETIO_NPORTS_MAX 9                          /*!< Number of ports supported : 0..9                                     */
#define VDETIO_NPORTS_SIZE 10                        /*!< Number of ports supported : 0..9                                     */

/*VDETAO5V0 peripheral*/
#define VDETAO5V0_PRESENT 1
#define VDETAO5V0_COUNT 1

/*VDET1V0 peripheral*/
#define VDET1V0_PRESENT 1
#define VDET1V0_COUNT 1

/*PMIC Controller*/
#define PMICC_PRESENT 1
#define PMICC_COUNT 1

