ankuns/nrfx/bsp/stable/mdk/nrf7140_sysctrl_peripherals.h
#define EGU130_PEND 0                                /*!< (unspecified)                                                        */
#define EGU130_CH_NUM_MIN 0                          /*!< (unspecified)                                                        */
#define EGU130_CH_NUM_MAX 7                          /*!< (unspecified)                                                        */
#define EGU130_CH_NUM_SIZE 8                         /*!< (unspecified)                                                        */

/*Coexistence controller*/
#define COEXC_PRESENT 1
#define COEXC_COUNT 1

#define COEXC_NCLIENTS_MIN 0                         /*!< Number of clients supported : 0..5                                   */
#define COEXC_NCLIENTS_MAX 5                         /*!< Number of clients supported : 0..5                                   */
#define COEXC_NCLIENTS_SIZE 6                        /*!< Number of clients supported : 0..5                                   */
#define COEXC_NMODES_MIN 0                           /*!< Number of modes per client: 0..3                                     */
#define COEXC_NMODES_MAX 3                           /*!< Number of modes per client: 0..3                                     */
#define COEXC_NMODES_SIZE 4                          /*!< Number of modes per client: 0..3                                     */
#define COEXC_NCCMALLOWMODES_MIN 0                   /*!< (unspecified)                                                        */
#define COEXC_NCCMALLOWMODES_MAX 3                   /*!< (unspecified)                                                        */
#define COEXC_NCCMALLOWMODES_SIZE 4                  /*!< (unspecified)                                                        */
#define COEXC_NPRIORITYBITS_MIN 16                   /*!< CCCONF priority bits : 16..23                                        */
#define COEXC_NPRIORITYBITS_MAX 23                   /*!< CCCONF priority bits : 16..23                                        */
#define COEXC_NPRIORITYBITS_SIZE 24                  /*!< CCCONF priority bits : 16..23                                        */
#define COEXC_COEXC_NUM_CLOCK_POWER_PAIR_MIN 0       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define COEXC_COEXC_NUM_CLOCK_POWER_PAIR_MAX 1       /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define COEXC_COEXC_NUM_CLOCK_POWER_PAIR_SIZE 2      /*!< Number of clock/power pairs used by the instance of PCGC Slave -
                                                          [0..1]*/
#define COEXC_COEXC_NOTFULLPCPZERO 1                 /*!< (unspecified)                                                        */

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 8

#define P0_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P0_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P0_FEATURE_PINS_PRESENT 0x00000FFFUL         /*!< (unspecified)                                                        */
#define P0_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P0_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P0_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P0_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P0_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P0_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P0_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P0_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P0_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P0_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P1_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P1_FEATURE_PINS_PRESENT 0x00000FFFUL         /*!< (unspecified)                                                        */
#define P1_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P1_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P1_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P1_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P1_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P1_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P1_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P1_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P1_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P1_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P2_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MAX 17                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_SIZE 18                           /*!< (unspecified)                                                        */
#define P2_FEATURE_PINS_PRESENT 0x0003FFFFUL         /*!< (unspecified)                                                        */
#define P2_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P2_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P2_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P2_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P2_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P2_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P2_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P2_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P2_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P2_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P3_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MAX 17                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_SIZE 18                           /*!< (unspecified)                                                        */
#define P3_FEATURE_PINS_PRESENT 0x0003FFFFUL         /*!< (unspecified)                                                        */
#define P3_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P3_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P3_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P3_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P3_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P3_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P3_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P3_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P3_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P3_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P5_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P5_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P5_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P5_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P5_PIN_NUM_MAX 13                            /*!< (unspecified)                                                        */
#define P5_PIN_NUM_SIZE 14                           /*!< (unspecified)                                                        */
#define P5_FEATURE_PINS_PRESENT 0x00003FFFUL         /*!< (unspecified)                                                        */
#define P5_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P5_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P5_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P5_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P5_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P5_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P5_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P5_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P5_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P5_BIASCTRL 1                                /*!< (unspecified)                                                        */

